Revit 2027 API
CADLinkOptions.PreserveOverrides Property
 Whether Revit should preserve the link's graphic overrides on reload.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool PreserveOverrides { get; set; }
Public Property PreserveOverrides As Boolean
	Get
	Set
public:
property bool PreserveOverrides {
	bool get ();
	void set (bool value);
}
member PreserveOverrides : bool with get, set
Property Value
Boolean
See Also
Reference
CADLinkOptions Class
Autodesk.Revit.DB Namespace